bolknote/MK61S_MINI/tests/m61_text_self_test.cpp
  // Повторная загрузка того же корневого файла не должна создавать пустую
  // карту: самый первый run уже использует ловушку предыдущего запуска.
  assert(m61_text::load_program("RESTART"));
  assert(fire_program_boundary(10));
  m61_text::service();
  assert(context_saves == 1 && context_restores == 1);

  // Если тот же inode переписали и объявление удалили, старый активный бит
  // не должен пережить повторную индексацию.
  m_IK1302.comma = 0;
  m61_text::service();
  assert(m61_text::active());
  scripts[0].source = "run\nret\n";
  assert(m61_text::load_program((u16) 0));
  assert(!fire_program_boundary(10));
  m61_text::cancel();

  // Активные адреса всё ещё изолированы по корневому файлу.
  reset_host();
  add_script(
      "FIRST",
      "trap 10 run :message\n"
      "ret\n"
      ":message\n"
      "ret\n");
  add_script(
      "SECOND",
      "run\n"
      "trap 10 run :message\n"
      "ret\n"
      ":message\n"
      "ret\n");
  assert(m61_text::load_program("FIRST"));
  assert(m61_text::active());
  assert(m61_text::load_program("SECOND"));
  assert(!fire_program_boundary(10));
  m61_text::cancel();
}

static void test_invalid_traps_fail_before_or_at_run(void) {
  reset_host();
  add_script("MISSING", "trap 10 run :missing\nrun\n");
  assert(!m61_text::load_program("MISSING"));
  m61_text::Error error = require_error();
  assert(error.line == 1);
  assert(std::strcmp(error.message, "trap label not found") == 0);
  assert(executed_commands == 0);

  reset_host();
  add_script("DUPTRAP",
             "trap 10 run :one\ntrap 10 run :two\n:one\nret\n:two\nret\n");
  assert(!m61_text::load_program("DUPTRAP"));
  error = require_error();
  assert(error.line == 2);
  assert(std::strcmp(error.message, "duplicate trap address") == 0);

  reset_host();
  add_script("RANGE", "trap 999999999999999999999 run :x\n:x\nret\n");
  assert(!m61_text::load_program("RANGE"));
  error = require_error();
  assert(error.line == 1);
  assert(std::strstr(error.message, "invalid trap") != nullptr);

  reset_host();
  add_script("CLASSIC", "trap 105 run :x\nrun\n:x\nret\n");
  assert(!m61_text::load_program("CLASSIC"));
  error = require_error();
  assert(error.line == 2);
  assert(std::strstr(error.message, "outside current program memory") != nullptr);

  reset_host();
  active_program_steps = core_61::MAX_PROGRAM_STEP;
  add_script("EXPANDED", "trap 105 run :x\nrun\nret\n:x\nret\n");
  assert(m61_text::load_program("EXPANDED"));
  assert(fire_program_boundary(105));
  m61_text::service();
  assert(context_saves == 1 && context_restores == 1);
  assert(!fire_program_boundary(105));
  m_IK1302.comma = 0;
  m61_text::service();
  assert(m61_text::active());
  m61_text::cancel();
}

static void test_trap_handler_requires_ret_and_restores_on_error(void) {
  reset_host();
  add_script(
      "NORET",
      "trap 10 run :message\n"
      "run\n"
      "ret\n"
      ":message\n"
      "ok\n");
  assert(m61_text::load_program("NORET"));
  assert(fire_program_boundary(10));
  m61_text::service();
  const m61_text::Error error = require_error();
  assert(std::strstr(error.message, "without ret") != nullptr);
  assert(context_saves == 1 && context_restores == 1);
  assert(!m61_text::calculator_suspended());
  assert(boundary_hook == nullptr);
}

static void test_bind_consumes_keyboard_opcode_and_calls_handler(void) {
  reset_host();
  add_script(
      "BIND",
      "bind AE run :pressed\n"
      "ret\n"
      ":pressed\n"
      "ok\n"
      "ret\n");
  assert(m61_text::load_program("BIND"));
  assert(m61_text::active());
  assert(core_61::registered_mk61_command_hook_count() == 2);

  assert(fire_mk61_command(
             0xAE, core_61::Mk61CommandSource::PROGRAM) == 0xAE);
  m61_text::service();
  assert(executed_lines.size() == 1);

  assert(fire_mk61_command(0xAD) == 0xAD);
  m61_text::service();
  assert(executed_lines.size() == 1);

  assert(fire_mk61_command(0xAE) == (u8) MK61_NOP);
  m61_text::service();
  assert(m61_text::active());
  assert(executed_lines.size() == 3);
  assert(executed_lines[1] == "ok");
  assert(executed_lines[2] == "ret");
  assert(core_61::registered_mk61_command_hook_count() == 2);

  assert(fire_mk61_command(0xAE) == (u8) MK61_NOP);
  m61_text::service();
  assert(executed_lines.size() == 5);
  m61_text::cancel();
  assert(core_61::registered_mk61_command_hook_count() == 0);
}

static void test_bind_is_validated_and_activated_only_when_executed(void) {
  reset_host();
  add_script("MISSING", "bind AE run :missing\nret\n");
  assert(!m61_text::load_program("MISSING"));
  m61_text::Error error = require_error();
  assert(std::strcmp(error.message, "bind label not found") == 0);

  reset_host();
  add_script(
      "DUPLICATE",
      "bind AE run :one\n"
      "bind AE run :two\n"
      ":one\nret\n"
      ":two\nret\n");
  assert(!m61_text::load_program("DUPLICATE"));
  error = require_error();
  assert(std::strcmp(error.message, "duplicate bind opcode") == 0);

  reset_host();
  add_script("RANGE", "bind F0 run :key\n:key\nret\n");
  assert(!m61_text::load_program("RANGE"));
  error = require_error();
  assert(std::strstr(error.message, "invalid bind") != nullptr);

  reset_host();
  add_script(
      "SKIPPED",
      "run :done\n"
      "bind AE run :pressed\n"
      ":done\n"
      "ret\n"
      ":pressed\n"
      "ret\n");
  assert(m61_text::load_program("SKIPPED"));
  assert(!m61_text::active());
  assert(core_61::registered_mk61_command_hook_count() == 0);
  assert(fire_mk61_command(0xAE) == 0xAE);
}

static void test_bind_handler_requires_ret(void) {
  reset_host();
  add_script(
      "BINDEND",
      "bind AE run :pressed\n"
      "ret\n"
      ":pressed\n"
      "ok\n");
  assert(m61_text::load_program("BINDEND"));
  assert(fire_mk61_command(0xAE) == (u8) MK61_NOP);
  m61_text::service();
  const m61_text::Error error = require_error();
  assert(std::strstr(error.message, "bind handler") != nullptr);
  assert(std::strstr(error.message, "without ret") != nullptr);
  assert(!m61_text::active());
  assert(core_61::registered_mk61_command_hook_count() == 0);
}

static void test_bind_limit_and_non_reentrant_handler(void) {
  reset_host();
  add_script(
      "EIGHT",
      "bind 00 run :pressed\n"
      "bind 01 run :pressed\n"
      "bind 02 run :pressed\n"
      "bind 03 run :pressed\n"
      "bind 04 run :pressed\n"
      "bind 05 run :pressed\n"
      "bind 06 run :pressed\n"
      "bind EF run :pressed\n"
      "ret\n"
      ":pressed\n"
      "wait 500\n"
      "ok\n"
      "ret\n");
  assert(m61_text::load_program("EIGHT"));
  m61_text::service(); // восьмая строка исчерпала бюджет первого прохода
  assert(core_61::registered_mk61_command_hook_count() == 16);
  assert(fire_mk61_command(0xEF) == (u8) MK61_NOP);
  m61_text::service();
  // Пока обработчик bind ждёт, новое нажатие не поглощается и не входит
  // в тот же обработчик повторно.
  assert(fire_mk61_command(0xEF) == 0xEF);
  fake_millis = 500;
  m61_text::service();
  assert(executed_lines.back() == "ret");

  reset_host();
  add_script(
      "NINE",
      "bind 00 run :pressed\n"
      "bind 01 run :pressed\n"
      "bind 02 run :pressed\n"
      "bind 03 run :pressed\n"
      "bind 04 run :pressed\n"
      "bind 05 run :pressed\n"
      "bind 06 run :pressed\n"
      "bind 07 run :pressed\n"
      "bind 08 run :pressed\n"
      ":pressed\n"
      "ret\n");
  assert(!m61_text::load_program("NINE"));
  const m61_text::Error error = require_error();
  assert(std::strcmp(error.message, "too many binds (maximum 8)") == 0);
}

